In [231]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [2]:
obj = Series([4, 7, -5, 3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = Series([4, 7, -5, 3], index = ["d", "b", "a", "c"])

In [7]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index([u'd', u'b', u'a', u'c'], dtype='object')

In [9]:
obj2["a"]

-5

In [10]:
obj2["d"]

4

In [11]:
obj2["d"] = 6

In [12]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [13]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64

In [14]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [15]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [18]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [19]:
"b" in obj2

True

In [20]:
"e" in obj2

False

In [21]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [22]:
obj3 = Series(sdata)

In [23]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [24]:
states = ["California", "Ohio", "Oregon", "Texas"]

In [25]:
obj4 = Series(sdata, index = states)

In [26]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [27]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [28]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [29]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [30]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [32]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [33]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [34]:
obj4.name = "population"

In [35]:
obj4.index.name = "state"

In [36]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [37]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [39]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]

In [40]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [41]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada"],
       "year": [2000, 2001, 2002, 2001, 2002],
       "pop": [1.5, 1.7, 3.6, 2.4, 2.9]}

In [42]:
data

{'pop': [1.5, 1.7, 3.6, 2.4, 2.9],
 'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002]}

In [43]:
frame = DataFrame(data)

In [44]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [45]:
DataFrame(data, columns = ["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [46]:
frame2 = DataFrame(data, columns = ["year", "state", "pop", "debt"], index = ["one", "two", "three", "four", "five"])

In [47]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [48]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [49]:
frame2["state"]

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [50]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [53]:
frame2.ix["three"]

c:\python27\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [54]:
frame2["debt"] = 16.5

In [55]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [56]:
frame2["debt"] = np.arange(5.)

In [57]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [58]:
val = Series([-1.2, -1.5, -1.7], index = ["two", "four", "five"])

In [59]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [60]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [61]:
frame2["debt"] = val

In [62]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [63]:
frame2["eastern"] = frame2.state == "Ohio"

In [64]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [65]:
del frame2["eastern"]

In [66]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [67]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [68]:
pop = {"Nevada": {2001: 2.4, 2002: 2.9}, "Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [69]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [70]:
frame3 = DataFrame(pop)

In [71]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [72]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [79]:
frame3["Ohio"][:-1]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [80]:
pdata = {"Ohio": frame3["Ohio"][:-1],
        "Nevada": frame3["Nevada"][:2]}

In [81]:
pdata

{'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64, 'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64}

In [83]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [84]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [85]:
frame3.index.name = "year"

In [86]:
frame3

      Nevada  Ohio
year
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [87]:
frame3.columns.name = "state"

In [88]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [89]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [90]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [91]:
frame2.values

array([[2000L, 'Ohio', 1.5, nan],
       [2001L, 'Ohio', 1.7, -1.2],
       [2002L, 'Ohio', 3.6, nan],
       [2001L, 'Nevada', 2.4, -1.5],
       [2002L, 'Nevada', 2.9, -1.7]], dtype=object)

In [92]:
obj = Series(range(3), index = ["a", "b", "c"])

In [93]:
obj

a    0
b    1
c    2
dtype: int64

In [94]:
index = obj.index

In [95]:
index

Index([u'a', u'b', u'c'], dtype='object')

In [96]:
index[1:]

Index([u'b', u'c'], dtype='object')

In [100]:
index = pd.Index(np.arange(3))

In [101]:
index

Int64Index([0, 1, 2], dtype='int64')

In [102]:
obj2 = Series([1.5, -2.5, 0], index = index)

In [103]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [104]:
obj2.index is index

True

In [105]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [106]:
"Ohio" in frame3.columns

True

In [107]:
2003 in frame3.index

False

In [108]:
obj = Series([4.5, 7.2, -5.3, 3.6], index = ["d", "b", "a", "c"])

In [109]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [110]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])

In [111]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [112]:
obj.reindex(["a", "b", "c", "d", "e"], fill_value = 0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [113]:
obj3 = Series(["blue", "purple", "yellow"], index = [0, 2, 4])

In [114]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [117]:
obj3.reindex(range(6), method = "ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [118]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index = ["a", "c", "d"],
                 columns = ["Ohio", "Texas", "California"])

In [119]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [120]:
frame2 = frame.reindex(["a", "b", "c", "d"])

In [121]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [122]:
states = ["Texas", "Utah", "California"]

In [123]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [124]:
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [130]:
frame.reindex(index = ["a", "b", "c", "d"], method = "ffill")

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [131]:
frame.ix[["a", "b", "c", "d"]]

c:\python27\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
c:\python27\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [132]:
obj = Series(np.arange(5), index = ["a", "b", "c", "d", "e"])

In [133]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [134]:
new_obj = obj.drop("c")

In [135]:
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [136]:
obj.drop(["d", "c"])

a    0
b    1
e    4
dtype: int32

In [137]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                index = ["Ohio", "Colorado", "Utah", "New York"],
                columns = ["one", "two", "three", "four"])

In [138]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [139]:
data.drop(["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [140]:
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [141]:
data.drop(["two", "four"], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [142]:
obj = Series(np.arange(4.), index = ["a", "b", "c", "d"])

In [143]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [144]:
obj["b"]

1.0

In [145]:
obj[1]

1.0

In [146]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [147]:
obj[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [148]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [149]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [150]:
obj["b": "c"]

b    1.0
c    2.0
dtype: float64

In [151]:
obj["b":"c"] = 5

In [152]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [153]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                index = ["Ohio", "Colorado", "Utah", "New York"],
                columns = ["one", "two", "three", "four"])

In [154]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [155]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [157]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [158]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [159]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [160]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [161]:
data[data < 5] = 0

In [162]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [163]:
data.ix["Colorado"]

c:\python27\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [164]:
data.ix["Colorado", ["two", "three"]]

c:\python27\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

two      5
three    6
Name: Colorado, dtype: int32

In [165]:
data.ix[["Colorado", "Utah"], [3, 0, 1]]

c:\python27\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [166]:
data.ix[2]

c:\python27\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [167]:
data.ix[:"Utah", "two"]

c:\python27\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [168]:
data.ix[data.three > 5, :3]

c:\python27\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [169]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index = ["a", "c", "d", "e"])

In [170]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [171]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index = ["a", "c", "e", "f", "g"])

In [172]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [173]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [174]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns = list("bcd"),
               index = ["Ohio", "Texas", "Colorado"])

In [175]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [177]:
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns = list("bde"),
               index = ["Utah", "Ohio", "Texas", "Oregon"])

In [178]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [179]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [180]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns = list("abcd"))

In [181]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [182]:
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns = list("abcde"))

In [183]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [184]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [185]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [188]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [189]:
df1.reindex(columns = df2.columns, fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [190]:
arr = np.arange(12.).reshape((3, 4))

In [191]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [192]:
arr[0]

array([0., 1., 2., 3.])

In [193]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [194]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns = list("bde"), index = ["Utah", "Ohio", "Texas", "Oregon"])

In [195]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [196]:
series = frame.ix[0]

c:\python27\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [197]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [198]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [199]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [200]:
series2 = Series(range(3), index = ["b", "e", "f"])

In [201]:
series2

b    0
e    1
f    2
dtype: int64

In [202]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [203]:
series3 = frame["d"]

In [204]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [205]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [206]:
frame = DataFrame(np.random.randn(4, 3), columns = list("bde"),
                 index = ["Utah", "Ohio", "Texas", "Oregon"])

In [207]:
frame

               b         d         e
Utah    0.636857 -1.688005  0.375771
Ohio    0.109326  1.128508 -1.708969
Texas   0.378928  0.052924  0.555699
Oregon  0.197989 -0.913960 -0.426986

In [208]:
np.abs(frame)

               b         d         e
Utah    0.636857  1.688005  0.375771
Ohio    0.109326  1.128508  1.708969
Texas   0.378928  0.052924  0.555699
Oregon  0.197989  0.913960  0.426986

In [209]:
f = lambda x: x.max() - x.min()

In [210]:
frame.apply(f)

b    0.527530
d    2.816513
e    2.264668
dtype: float64

In [211]:
frame.apply(f, axis=1)

Utah      2.324862
Ohio      2.837477
Texas     0.502775
Oregon    1.111949
dtype: float64

In [212]:
def f(x):
    return Series([x.min(), x.max()], index = ["min", "max"])

In [213]:
frame.apply(f)

            b         d         e
min  0.109326 -1.688005 -1.708969
max  0.636857  1.128508  0.555699

In [214]:
format = lambda x: "%.2f" % x

In [215]:
frame.applymap(format)

           b      d      e
Utah    0.64  -1.69   0.38
Ohio    0.11   1.13  -1.71
Texas   0.38   0.05   0.56
Oregon  0.20  -0.91  -0.43

In [216]:
frame["e"].map(format)

Utah       0.38
Ohio      -1.71
Texas      0.56
Oregon    -0.43
Name: e, dtype: object

In [217]:
obj = Series(range(4), index = ["d", "a", "b", "c"])

In [219]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [220]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [221]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index = ["three", "one"],
                 columns = ["d", "a", "b", "c"])

In [222]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [223]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [224]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [225]:
frame.sort_index(axis=1, ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [226]:
obj = Series([4, 7, -3, 2])

In [227]:
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [233]:
frame = DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})

In [234]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [235]:
frame.sort_index(by = "b")

c:\python27\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [236]:
frame.sort_index(by = ["a", "b"])

c:\python27\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [237]:
obj = Series(range(5), index = ["a", "a", "b", "b", "c"])

In [238]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [239]:
obj.index.is_unique

False

In [240]:
obj["a"]

a    0
a    1
dtype: int64

In [241]:
obj["c"]

4

In [242]:
df = DataFrame(np.random.randn(4, 3), index = ["a", "a", "b", "b"])

In [243]:
df

          0         1         2
a  0.208231 -0.470529  0.789202
a -0.567895 -0.715196  1.180265
b  0.511050 -0.448357 -0.236682
b -0.089135  0.890723 -1.312080

In [244]:
df.ix["b"]

c:\python27\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          0         1         2
b  0.511050 -0.448357 -0.236682
b -0.089135  0.890723 -1.312080

In [245]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
               [np.nan, np.nan], [0.75, -1.3]],
              index = ["a", "b", "c", "d"],
              columns = ["one", "two"])

In [246]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [247]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [248]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [249]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [251]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [250]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [252]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [253]:
obj = Series(["a", "a", "b", "c"] * 4)

In [254]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [255]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [256]:
obj = Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])

In [257]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [258]:
uniques = obj.unique()

In [259]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [260]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [261]:
obj.values

array(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'], dtype=object)

In [262]:
pd.value_counts(obj.values, sort = False)

a    3
c    3
b    2
d    1
dtype: int64

In [263]:
mask = obj.isin(["b", "c"])

In [264]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [265]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [266]:
data = DataFrame({"Qu1": [1, 3, 4, 3, 4],
                  "Qu2": [2, 3, 1, 2, 3],
                  "Qu3": [1, 5, 2, 4, 4]})

In [267]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [269]:
result = data.apply(pd.value_counts).fillna(0)

In [270]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [271]:
string_data = Series(["aardvark", "artichoke", np.nan, "avocado"])

In [272]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [273]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [274]:
string_data[0] = None

In [275]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [276]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [277]:
from numpy import nan as NA

In [278]:
data = Series([1, NA, 3.5, NA, 7])

In [279]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [280]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [281]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [282]:
data = DataFrame([[1, 6.5, 3], [1., NA, NA],
                 [NA, NA, NA], [NA, 6.5, 3.]])

In [283]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [284]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [286]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [287]:
data[4] = NA

In [288]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [289]:
data.dropna(axis=1, how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [290]:
df = DataFrame(np.random.randn(7, 3))

In [291]:
df

          0         1         2
0  0.949938  0.556125 -0.513808
1  0.355058 -0.535698  0.073483
2  1.032116  0.248652 -0.430784
3  0.842304  0.893595  0.376619
4  2.229263 -0.548219 -0.802039
5 -0.739654  0.849069 -1.673549
6 -1.820110  0.900224 -1.012979

In [292]:
df.ix[:4, 1] = NA

c:\python27\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [293]:
df

          0         1         2
0  0.949938       NaN -0.513808
1  0.355058       NaN  0.073483
2  1.032116       NaN -0.430784
3  0.842304       NaN  0.376619
4  2.229263       NaN -0.802039
5 -0.739654  0.849069 -1.673549
6 -1.820110  0.900224 -1.012979

In [294]:
df.ix[:2, 2] = NA

c:\python27\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [295]:
df

          0         1         2
0  0.949938       NaN       NaN
1  0.355058       NaN       NaN
2  1.032116       NaN       NaN
3  0.842304       NaN  0.376619
4  2.229263       NaN -0.802039
5 -0.739654  0.849069 -1.673549
6 -1.820110  0.900224 -1.012979

In [296]:
df.dropna(thresh=3)

          0         1         2
5 -0.739654  0.849069 -1.673549
6 -1.820110  0.900224 -1.012979

In [297]:
df.fillna(0)

          0         1         2
0  0.949938  0.000000  0.000000
1  0.355058  0.000000  0.000000
2  1.032116  0.000000  0.000000
3  0.842304  0.000000  0.376619
4  2.229263  0.000000 -0.802039
5 -0.739654  0.849069 -1.673549
6 -1.820110  0.900224 -1.012979

In [298]:
_ = df.fillna(0, inplace = True)

In [299]:
df

          0         1         2
0  0.949938  0.000000  0.000000
1  0.355058  0.000000  0.000000
2  1.032116  0.000000  0.000000
3  0.842304  0.000000  0.376619
4  2.229263  0.000000 -0.802039
5 -0.739654  0.849069 -1.673549
6 -1.820110  0.900224 -1.012979

In [300]:
df = DataFrame(np.random.randn(6, 3))

In [301]:
df

          0         1         2
0  0.841595 -0.601660 -0.719057
1 -0.024734  1.135951  1.108238
2  0.921523  0.288812 -1.098278
3 -1.948088 -0.440022  2.264486
4  0.240070 -1.131740  0.152419
5 -0.632946 -1.334045  0.185897

In [303]:
df.ix[2:, 1] = NA

c:\python27\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [304]:
df

          0         1         2
0  0.841595 -0.601660 -0.719057
1 -0.024734  1.135951  1.108238
2  0.921523       NaN -1.098278
3 -1.948088       NaN  2.264486
4  0.240070       NaN  0.152419
5 -0.632946       NaN  0.185897

In [305]:
df.ix[4:, 2] = NA

c:\python27\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [306]:
df

          0         1         2
0  0.841595 -0.601660 -0.719057
1 -0.024734  1.135951  1.108238
2  0.921523       NaN -1.098278
3 -1.948088       NaN  2.264486
4  0.240070       NaN       NaN
5 -0.632946       NaN       NaN

In [307]:
df.fillna(method = "ffill")

          0         1         2
0  0.841595 -0.601660 -0.719057
1 -0.024734  1.135951  1.108238
2  0.921523  1.135951 -1.098278
3 -1.948088  1.135951  2.264486
4  0.240070  1.135951  2.264486
5 -0.632946  1.135951  2.264486

In [308]:
df.fillna(method = "ffill", limit = 2)

          0         1         2
0  0.841595 -0.601660 -0.719057
1 -0.024734  1.135951  1.108238
2  0.921523  1.135951 -1.098278
3 -1.948088  1.135951  2.264486
4  0.240070       NaN  2.264486
5 -0.632946       NaN  2.264486

In [309]:
data = Series([1., NA, 3.5, NA, 7])

In [310]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [311]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [312]:
data = Series(np.random.randn(10),
             index = [["a", "a", "a", "b", "b", "b", "c", "c", "d", "d"],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [313]:
data

a  1   -0.092128
   2    0.759627
   3   -0.513828
b  1   -0.010588
   2   -0.651159
   3   -1.248112
c  1    1.519999
   2   -2.478224
d  2   -0.735700
   3    0.782949
dtype: float64

In [314]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [315]:
data["b"]

1   -0.010588
2   -0.651159
3   -1.248112
dtype: float64

In [316]:
data["b"]

1   -0.010588
2   -0.651159
3   -1.248112
dtype: float64

In [317]:
data["b": "c"]

b  1   -0.010588
   2   -0.651159
   3   -1.248112
c  1    1.519999
   2   -2.478224
dtype: float64

In [318]:
data.ix[["b", "d"]]

c:\python27\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

b  1   -0.010588
   2   -0.651159
   3   -1.248112
d  2   -0.735700
   3    0.782949
dtype: float64

In [319]:
data[:, 2]

a    0.759627
b   -0.651159
c   -2.478224
d   -0.735700
dtype: float64

In [320]:
data.unstack()

          1         2         3
a -0.092128  0.759627 -0.513828
b -0.010588 -0.651159 -1.248112
c  1.519999 -2.478224       NaN
d       NaN -0.735700  0.782949

In [321]:
data.unstack().stack()

a  1   -0.092128
   2    0.759627
   3   -0.513828
b  1   -0.010588
   2   -0.651159
   3   -1.248112
c  1    1.519999
   2   -2.478224
d  2   -0.735700
   3    0.782949
dtype: float64

In [324]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                 index = [["a", "a", "b", "b"], [1, 2, 1, 2]],
                 columns = [["Ohio", "Ohio", "Colorado"],
                           ["Green", "Red", "Green"]])

In [325]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [326]:
frame.index.names = ["key1", "key2"]

In [327]:
frame

           Ohio     Colorado
          Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [328]:
frame.columns.names = ["state", "color"]

In [329]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [330]:
frame["Ohio"]

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [331]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [332]:
frame.swaplevel("key1", "key2")

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [333]:
frame.sortlevel(0)

c:\python27\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [334]:
frame.sortlevel(1)

c:\python27\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [335]:
frame.sum(level = "key2")

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [336]:
frame.sum(level = "color", axis = 1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [337]:
frame = DataFrame({"a": range(7), "b": range(7, 0, -1),
                  "c": ["one", "one", "one", "two", "two", "two", "two"],
                  "d": [0, 1, 2, 0, 1, 2, 3]})

In [338]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [339]:
frame2 = frame.set_index(["c", "d"])

In [340]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [341]:
frame.set_index(["c", "d"])

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [342]:
frame.set_index(["c", "d"], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [343]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [344]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1